<template>
  <div>
      <!--第一层路由，显示框架layout-->
      <router-view/>

  </div>

</template>

<!--
开发思路：
之后这个小小项目为我的开发脚手架
首先vue中需要修改的页面为
0、因为我还是打算用element plus组件得话，记得在你创建得文件目录下import引入下elemenui。
1、request.js文件  照抄我这个模板就行  注意实现跨域问题，因为前后端端口不能一样，同时功能是将前端数据转化成json的字符串给后端才能识别
2.index.js文件  是路由路径添加，注意如果开发新的组件的时候，需要添加路由才能显示所封装的组件
3.值得注意的点是：组件文件下，一般都是侧边和导航栏，视图文件下是一般是table表的，是要存数据的，比如是从数据库中拿数据的
4.App.vue是启动类，类似后端的启动类，一般不用管
5.asset是放静态资源的吧，可以在这里开发写你自己的css样式，
6.剩余细节再另外得视图文件中详细写了
-->


<script>
export default {
  name: "App",
}
</script>
